app/Controllers/Admin.php

SELECT *
FROM `profil`
 LIMIT 1
---
    public function Setting()
    {

        $data = [
            'menu' => 'setting',
            'page' => 'admin/superadmin/setting',
            'web' => $this->ModelSetting->DataWeb(),
            'profil' => $this->profilModel->first() ?? [],