app/Controllers/Home.php

SELECT *
FROM `tbl_galeri`
WHERE `id_sekolah` = '3'
ORDER BY `created_at` DESC
---
    public function sekolah($id_sekolah)
    {
        $data = $this->landingData('Detail Sekolah', 'sekolah_detail');

        $data['sekolah'] = $this->ModelSekolah->DetailData($id_sekolah);

        $data['galeri'] = $this->ModelGaleri
            ->where('id_sekolah', $id_sekolah)
            ->orderBy('created_at', 'DESC')
            ->findAll();