app/Controllers/User.php

    public function index()
    {
        $data = [
            'menu' => 'profil',
            'profil' => $this->profilModel->first() ?? [],
---
SELECT *
FROM `profil`
 LIMIT 1

    public function UpdatePassword()
    {
        $rules = [
            'id_user'      => 'required|is_natural_no_zero',
            'password'     => 'required|min_length[6]',
            'pass_confirm' => 'required|matches[password]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $idUser      = (int) $this->request->getPost('id_user');
        $newPassword = $this->request->getPost('password');

        if (isSuperAdmin()) {

            $this->ModelUser->update($idUser, [
                'password' => password_hash($newPassword, PASSWORD_DEFAULT),
            ]);
---
UPDATE `tbl_user` SET `password` = '$2y$10$HVm.7puEzrVetLhq6/GFx.wPKBRgUW6pbjc/O45OT94J5xMbqwWga'
WHERE `tbl_user`.`id_user` IN (1)

                    ]);
            }

            $this->ModelUser->update($idUser, [
                'password' => password_hash($newPassword, PASSWORD_DEFAULT),
            ]);
---
UPDATE `tbl_user` SET `password` = '$2y$10$tI3T3nTSLJT6SMbAt4aLQ.FBDUhS0HasG/T2x0lsybMHmJ2bdZyOS'
WHERE `tbl_user`.`id_user` IN (1)