app/Models/ModelJenjang.php

    public function AllData()
    {
        return $this->db->table('tbl_jenjang')
                ->get()->getResultArray();
---
SELECT *
FROM `tbl_jenjang`

    public function DetailData($id_jenjang)
    {
        return $this->db->table('tbl_jenjang')
            ->where('id_jenjang', $id_jenjang)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_jenjang`
WHERE `id_jenjang` = '2'

    public function UpdateData($data)
    {
        return $this->db->table('tbl_jenjang')
            ->where('id_jenjang', $data['id_jenjang'])
            ->update($data);
---
UPDATE `tbl_jenjang` SET `id_jenjang` = '2', `jenjang` = 'SMP', `marker` = '1781600680_0de56bab167d3b675b3d.png'
WHERE `id_jenjang` = '2'