app/Models/ModelSekolah.php

    public function AllData()
    {
        return $this->db->table('tbl_sekolah')
            ->select('tbl_sekolah.*, tbl_jenjang.jenjang, tbl_jenjang.marker, tbl_kabupaten.nama_kabupaten, tbl_kecamatan.nama_kecamatan, tbl_nagari.nama_nagari')
            ->join('tbl_jenjang', 'tbl_sekolah.id_jenjang = tbl_jenjang.id_jenjang', 'left')
            ->join('tbl_kabupaten', 'tbl_sekolah.id_kabupaten = tbl_kabupaten.id_kabupaten', 'left')
            ->join('tbl_kecamatan', 'tbl_sekolah.id_kecamatan = tbl_kecamatan.id_kecamatan', 'left')
            ->join('tbl_nagari', 'tbl_sekolah.id_nagari = tbl_nagari.id_nagari', 'left')
            ->get()->getResultArray();
---
SELECT `tbl_sekolah`.*, `tbl_jenjang`.`jenjang`, `tbl_jenjang`.`marker`, `tbl_kabupaten`.`nama_kabupaten`, `tbl_kecamatan`.`nama_kecamatan`, `tbl_nagari`.`nama_nagari`
FROM `tbl_sekolah`
LEFT JOIN `tbl_jenjang` ON `tbl_sekolah`.`id_jenjang` = `tbl_jenjang`.`id_jenjang`
LEFT JOIN `tbl_kabupaten` ON `tbl_sekolah`.`id_kabupaten` = `tbl_kabupaten`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_sekolah`.`id_kecamatan` = `tbl_kecamatan`.`id_kecamatan`
LEFT JOIN `tbl_nagari` ON `tbl_sekolah`.`id_nagari` = `tbl_nagari`.`id_nagari`

    public function DetailData($id_sekolah)
    {
        return $this->db->table('tbl_sekolah')
            ->join('tbl_jenjang', 'tbl_sekolah.id_jenjang = tbl_jenjang.id_jenjang', 'left')
            ->join('tbl_kabupaten', 'tbl_sekolah.id_kabupaten = tbl_kabupaten.id_kabupaten', 'left')
            ->join('tbl_kecamatan', 'tbl_sekolah.id_kecamatan = tbl_kecamatan.id_kecamatan', 'left')
            ->join('tbl_nagari', 'tbl_sekolah.id_nagari = tbl_nagari.id_nagari', 'left')
            ->where('tbl_sekolah.id_sekolah', $id_sekolah)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_sekolah`
LEFT JOIN `tbl_jenjang` ON `tbl_sekolah`.`id_jenjang` = `tbl_jenjang`.`id_jenjang`
LEFT JOIN `tbl_kabupaten` ON `tbl_sekolah`.`id_kabupaten` = `tbl_kabupaten`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_sekolah`.`id_kecamatan` = `tbl_kecamatan`.`id_kecamatan`
LEFT JOIN `tbl_nagari` ON `tbl_sekolah`.`id_nagari` = `tbl_nagari`.`id_nagari`
WHERE `tbl_sekolah`.`id_sekolah` = '3'

    public function allKecamatan($id_kabupaten = null)
    {
        $builder = $this->db->table('tbl_kecamatan');
        $builder->select('tbl_kecamatan.*, tbl_kabupaten.nama_kabupaten')
            ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_kecamatan.id_kabupaten', 'left');

        if ($id_kabupaten !== null && $id_kabupaten !== '') {
            $builder->where('tbl_kecamatan.id_kabupaten', $id_kabupaten);
        } else {
            $builder->groupStart()
                ->where('LOWER(tbl_kabupaten.nama_kabupaten) LIKE', '%tanah datar%')
                ->orWhere('LOWER(tbl_kabupaten.nama_kabupaten) LIKE', '%tanahdatar%')
                ->groupEnd();
        }

        $result = $builder->orderBy('tbl_kecamatan.nama_kecamatan', 'ASC')->get()->getResultArray();
---
SELECT `tbl_kecamatan`.*, `tbl_kabupaten`.`nama_kabupaten`
FROM `tbl_kecamatan`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_kecamatan`.`id_kabupaten`
WHERE `tbl_kecamatan`.`id_kabupaten` = '1305'
ORDER BY `tbl_kecamatan`.`nama_kecamatan` ASC

    public function allNagari($id_kecamatan)
    {
        return $this->db->table('tbl_nagari')
            ->where('id_kecamatan', $id_kecamatan)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_nagari`
WHERE `id_kecamatan` = '1305060'