app/Models/ModelWilayah.php

SELECT *
FROM `tbl_wilayah`
---
    public function AllData()
    {
        return $this->db->table('tbl_wilayah')
                ->get()->getResultArray();