app/Models/ModelUser.php

    public function getUsersWithSchool(): array
    {
        return $this->db->table('tbl_user')
            ->select('tbl_user.id_user, tbl_user.id_sekolah, tbl_user.nama_user, tbl_user.email, tbl_user.role, tbl_user.status, tbl_sekolah.npsn')
            ->join('tbl_sekolah', 'tbl_user.id_sekolah = tbl_sekolah.id_sekolah', 'left')
            ->where('tbl_user.role !=', 'super_admin')
            ->orderBy('tbl_user.nama_user', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `tbl_user`.`id_user`, `tbl_user`.`id_sekolah`, `tbl_user`.`nama_user`, `tbl_user`.`email`, `tbl_user`.`role`, `tbl_user`.`status`, `tbl_sekolah`.`npsn`
FROM `tbl_user`
LEFT JOIN `tbl_sekolah` ON `tbl_user`.`id_sekolah` = `tbl_sekolah`.`id_sekolah`
WHERE `tbl_user`.`role` != 'super_admin'
ORDER BY `tbl_user`.`nama_user` ASC